chememjc/MSP430-RC522-CCS/RFIDaccessControl/i2c.c
/*
 * i2c.c
 *
 *  Created on: Jun 9, 2016
 *      Author: mcurtis
 */
/* UCB0 -- Registers of Interest
*UCB0CTL0	Control Reg 0
*UCB0CTL1	Control Reg 1
*UCB0BR0	Baud rate control reg 0
*UCB0BR1	Baud rate control reg 1
*UCB0I2CE	Interrup enable register
*UCB0STAT	Status register
*UCB0RXBUF	Receive buffer
*UCB0TXBUF	Transmit buffer
*UCB0I2COA	Own Address
*UCB0I2CSA	Slave Address
*IE2		SFR interrupt enable register 2
*IFG2		SFR interrupt flag register 2
*/
#include <msp430f2419.h>
#include "i2c.h"

signed char byteCtr;
unsigned char *TI_receive_field;
unsigned char *TI_transmit_field;
unsigned char Rstart=0;

void i2cinit(unsigned int prescaler){
	unsigned char br[2];
	Rstart=0;  //disable repeated shart
	br[0]=prescaler & 0x00FF;
	br[1]=prescaler>>8 & 0x00FF;
	UCB0CTL1 = UCSWRST;                        // Enable SW reset
	UCB0CTL0 = UCMST + UCMODE_3 + UCSYNC;       // I2C Master, synchronous mode
	UCB0CTL1 = UCSSEL_2 + UCSWRST;              // Use SMCLK, keep SW reset
	UCB0BR0 = br[0];                         // set prescaler
	UCB0BR1 = br[1];
	UCB0I2CSA = 0x01;                  // set slave address
	UCB0CTL1 &= ~UCSWRST;                       // Clear SW reset, resume operation
	UCB0I2CIE = UCNACKIE;					//enable interrupt on nack, send stop
	IE2 |= UCB0TXIE;
	return;
}

void i2ctx(unsigned char addr, unsigned char *data, unsigned int len){
	unsigned int i;
	UCB0I2CSA = addr;
	UCB0CTL1 |= UCTR+ UCTXSTT; //transmit mode, and start
	for(i=0; i<len; i++){
		UCB0TXBUF=data[i];
		while(!(IFG2&UCB0TXIFG)); //wait for tx ready
	}
	return;
}
void i2crx(unsigned char addr, unsigned char *data, unsigned int len){
	unsigned int i;
	UCB0I2CSA = addr;
	UCB0CTL1 &= ~UCTR; //receive mode
	UCB0CTL1 |= UCTXSTT;
	for(i=0; i<len; i++){
		while(UCB0CTL1 & UCTXSTT); //wait for data
		data[len]=UCB0RXBUF;
		if(i==len-1) UCB0CTL1 |= UCTXNACK;
	}
	UCB0CTL1 |= UCTXSTT;
	return;
}
void i2ctxrx(unsigned char addr, unsigned char txdata ,unsigned char *data, unsigned int len){
	unsigned int i;
	UCB0I2CSA = addr;
	UCB0CTL1 |= UCTR; //transmit mode
	UCB0CTL1 |= UCTXSTT;
	while(IFG2&UCB0TXIFG); //wait for start/address to be sent
	UCB0TXBUF=txdata;
	while(IFG2&UCB0TXIFG); //wait for data to be sent
	UCB0CTL1 = (UCB0CTL1&~UCTR) | UCTXSTT;
	for(i=0; i<len; i++){
		while(IFG2&UCB0RXIFG); //wait for data
		data[i]=UCB0RXBUF;
		if(i==len-1) UCB0CTL1 |= UCTXNACK;
	}
	UCB0CTL1 |= UCTXSTT;
	return;
}

unsigned char i2cslavecheck(unsigned char addr){
	unsigned char ie2bkup, i2ciebkup, retval;
	i2ciebkup = UCB0I2CIE;                      // restore old UCB0I2CIE
	ie2bkup = IE2;                              // store IE2 register
	__disable_interrupt();
	UCB0I2CIE &= ~ UCNACKIE;                    // no NACK interrupt
	UCB0I2CSA = addr;                  // set slave address
	IE2 &= ~(UCB0TXIE + UCB0RXIE);              // no RX or TX interrupts
	UCB0CTL1 |= UCTR + UCTXSTT + UCTXSTP;       // I2C TX, start condition
	while (UCB0CTL1 & UCTXSTP);                 // wait for STOP condition
	retval = !(UCB0STAT & UCNACKIFG);
	IE2 = ie2bkup;                              // restore IE2
	UCB0I2CIE = i2ciebkup;                      // restore old UCB0CTL1
	__enable_interrupt();
	return retval;                         // return whether or not
                                              	// a NACK occured
}

//  Description: This code configures the MSP430's USCI module as
//  I2C master capable of transmitting and receiving bytes.
//
//  ***THIS IS THE MASTER CODE***
//
//                    Master
//                 MSP430F2619
//             -----------------
//         /|\|              XIN|-
//          | |                 |
//          --|RST          XOUT|-
//            |                 |
//            |                 |
//            |                 |
//            |         SDA/P3.1|------->
//            |         SCL/P3.2|------->
//
// Note: External pull-ups are needed for SDA & SCL
//
// Uli Kretzschmar
// Texas Instruments Deutschland GmbH
// November 2007
// Built with IAR Embedded Workbench Version: 3.42A
//******************************************************************************
//#include "msp430x22x4.h"
//#include "msp430x23x0.h"
//#include "msp430xG46x.h"
// ...                                         // more devices are possible
//------------------------------------------------------------------------------
// void TI_USCI_I2C_receiveinit(unsigned char slave_address,
//                              unsigned char prescale)
//
// This function initializes the USCI module for master-receive operation.
//
// IN:   unsigned char slave_address   =>  Slave Address
//       unsigned char prescale        =>  SCL clock adjustment
//-----------------------------------------------------------------------------
void TI_USCI_I2C_receiveinit(unsigned char slave_address,
                             unsigned char prescale){
  P3SEL |= SDA_PIN + SCL_PIN;                 // Assign I2C pins to USCI_B0
  UCB0CTL1 = UCSWRST;                        // Enable SW reset
  UCB0CTL0 = UCMST + UCMODE_3 + UCSYNC;       // I2C Master, synchronous mode
  UCB0CTL1 = UCSSEL_2 + UCSWRST;              // Use SMCLK, keep SW reset
  UCB0BR0 = prescale;                         // set prescaler
  UCB0BR1 = 0;
  UCB0I2CSA = slave_address;                  // set slave address
  UCB0CTL1 &= ~UCSWRST;                       // Clear SW reset, resume operation
  UCB0I2CIE = UCNACKIE;
  IE2 |= UCB0RXIE;                            // Enable RX interrupt
}

//------------------------------------------------------------------------------
// void TI_USCI_I2C_transmitinit(unsigned char slave_address,
//                               unsigned char prescale)
//
// This function initializes the USCI module for master-transmit operation.
//
// IN:   unsigned char slave_address   =>  Slave Address
//       unsigned char prescale        =>  SCL clock adjustment
//------------------------------------------------------------------------------
void TI_USCI_I2C_transmitinit(unsigned char slave_address,
                          unsigned char prescale){
  P3SEL |= SDA_PIN + SCL_PIN;                 // Assign I2C pins to USCI_B0
  UCB0CTL1 = UCSWRST;                        // Enable SW reset
  UCB0CTL0 = UCMST + UCMODE_3 + UCSYNC;       // I2C Master, synchronous mode
  UCB0CTL1 = UCSSEL_2 + UCSWRST;              // Use SMCLK, keep SW reset
  UCB0BR0 = prescale;                         // set prescaler
  UCB0BR1 = 0;
  UCB0I2CSA = slave_address;                  // Set slave address
  UCB0CTL1 &= ~UCSWRST;                       // Clear SW reset, resume operation
  UCB0I2CIE = UCNACKIE;
  IE2 |= UCB0TXIE;                            // Enable TX ready interrupt
}

//------------------------------------------------------------------------------
// void TI_USCI_I2C_receive(unsigned char byteCount, unsigned char *field)
//
// This function is used to start an I2C commuincation in master-receiver mode.
//
// IN:   unsigned char byteCount  =>  number of bytes that should be read
//       unsigned char *field     =>  array variable used to store received data
//------------------------------------------------------------------------------
void TI_USCI_I2C_receive(unsigned char byteCount, unsigned char *field){
  TI_receive_field = field;
  if ( byteCount == 1 ){
    byteCtr = 0 ;
    __disable_interrupt();
    UCB0CTL1 |= UCTXSTT;                      // I2C start condition
    while (UCB0CTL1 & UCTXSTT);               // Start condition sent?
    UCB0CTL1 |= UCTXSTP;                      // I2C stop condition
    __enable_interrupt();
  } else if ( byteCount > 1 ) {
    byteCtr = byteCount - 2 ;
    UCB0CTL1 |= UCTXSTT;                      // I2C start condition
  } else
    while (1);                                // illegal parameter
}

//------------------------------------------------------------------------------
// void TI_USCI_I2C_transmit(unsigned char byteCount, unsigned char *field)
//
// This function is used to start an I2C commuincation in master-transmit mode.
//
// IN:   unsigned char byteCount  =>  number of bytes that should be transmitted
//       unsigned char *field     =>  array variable. Its content will be sent.
//------------------------------------------------------------------------------
void TI_USCI_I2C_transmit(unsigned char byteCount, unsigned char *field){
  TI_transmit_field = field;
  byteCtr = byteCount;
  UCB0CTL1 |= UCTR + UCTXSTT;                 // I2C TX, start condition
}

//------------------------------------------------------------------------------
// unsigned char TI_USCI_I2C_slave_present(unsigned char slave_address)
//
// This function is used to look for a slave address on the I2C bus.
//
// IN:   unsigned char slave_address  =>  Slave Address
// OUT:  unsigned char                =>  0: address was not found,
//                                        1: address found
//------------------------------------------------------------------------------
unsigned char TI_USCI_I2C_slave_present(unsigned char slave_address){
  unsigned char ie2_bak, slaveadr_bak, ucb0i2cie, returnValue;
  ucb0i2cie = UCB0I2CIE;                      // restore old UCB0I2CIE
  ie2_bak = IE2;                              // store IE2 register
  slaveadr_bak = UCB0I2CSA;                   // store old slave address
  UCB0I2CIE &= ~ UCNACKIE;                    // no NACK interrupt
  UCB0I2CSA = slave_address;                  // set slave address
  IE2 &= ~(UCB0TXIE + UCB0RXIE);              // no RX or TX interrupts
  __disable_interrupt();
  UCB0CTL1 |= UCTR + UCTXSTT + UCTXSTP;       // I2C TX, start condition
  while (UCB0CTL1 & UCTXSTP);                 // wait for STOP condition

  returnValue = !(UCB0STAT & UCNACKIFG);
  __enable_interrupt();
  IE2 = ie2_bak;                              // restore IE2
  UCB0I2CSA = slaveadr_bak;                   // restore old slave address
  UCB0I2CIE = ucb0i2cie;                      // restore old UCB0CTL1
  return returnValue;                         // return whether or not
                                              // a NACK occured
}

//------------------------------------------------------------------------------
// unsigned char TI_USCI_I2C_notready()
//
// This function is used to check if there is commuincation in progress.
//
// OUT:  unsigned char  =>  0: I2C bus is idle,
//                          1: communication is in progress
//------------------------------------------------------------------------------
unsigned char TI_USCI_I2C_notready(){
  return (UCB0STAT & UCBBUSY);
}


/*#pragma vector = USCIAB0RX_VECTOR
__interrupt void USCIAB0RX_ISR(void)
{
  if (UCB0STAT & UCNACKIFG){            // send STOP if slave sends NACK
    UCB0CTL1 |= UCTXSTP;
    UCB0STAT &= ~UCNACKIFG;
  }

}*/


#pragma vector = USCIAB0TX_VECTOR
__interrupt void USCIAB0TX_ISR(void)
{
  if (IFG2 & UCB0RXIFG){
    if ( byteCtr == 0 ){
      UCB0CTL1 |= UCTXSTP;                    // I2C stop condition
      *TI_receive_field = UCB0RXBUF;
      TI_receive_field++;
    }
    else {
      *TI_receive_field = UCB0RXBUF;
      TI_receive_field++;
      byteCtr--;
    }
  }
  else {
    if (byteCtr == 0){
      UCB0CTL1 |= UCTXSTP;                    // I2C stop condition
      IFG2 &= ~UCB0TXIFG;                     // Clear USCI_B0 TX int flag
    }
    else {
      UCB0TXBUF = *TI_transmit_field;
      TI_transmit_field++;
      byteCtr--;
    }
  }
}

